Tekla.Structures.Model.BaseWeld.WeldIntermittentTypeEnum
Weld intermittent types.

Tekla.Structures.Model.BaseWeld.WeldIntermittentTypeEnum.CONTINUOUS
Continuous.

Tekla.Structures.Model.BaseWeld.WeldIntermittentTypeEnum.CHAIN_INTERMITTENT
Chain intermittent.

Tekla.Structures.Model.BaseWeld.WeldIntermittentTypeEnum.STAGGERED_INTERMITTENT
Staggered intermittent.